Repository: Abuenameh/GNUSim8085
Catalog: po/*.po
Languages: nl

source: Select font
nl: Lettertype selecteren

source: Program has errors. Check the Message pane.
nl: De applicatie bevat fouten. Controleer het Berichtpaneel.

source: Error executing program
nl: Fout tijdens uitvoeren van applicatie

source: Error in step in
nl: Fout in step in

source: Error in step over
nl: Fout in step over

source: Error in step out
nl: Fout in step out

source: Enter a valid number within range
nl: Voer een geldig nummer in binnen het bereik

source: Enter a valid number within range (0-65535 or 0h-FFFFh)
nl: Voer een geldig nummer in binnen het bereik (0-65535 of 0h-FFFFh)

source: Enter a valid number within range (0-255 / 0h-00FFh)
nl: Voer een geldig nummer in binnen het bereik (0-255 / 0h-00FFh)

source: The tutorial file, asm-guide.txt, was not found. It should be present in directory -
nl: Het zelfstudiebestand, asm-guide.text, kan niet worden gevonden. Het moet aanwezig zijn in de map -

source: _File
nl: _Bestand

source: _Reset
nl: _Herstellen

source: _Assembler
nl: _Bouwer

source: _Debug
nl: _Foutopsporing

source: _Breakpoints
nl: _Breekpunten

source: _Help
nl: _Hulp

source: New source file
nl: Nieuw bronbestand

source: Open a file
nl: Een bestand openen

source: Save file
nl: Bestand opslaan

source: Save file as
nl: Bestand opslaan als

source: Print program
nl: Applicatie printen

source: Reset Registers
nl: Registers herstellen

source: _Flags
nl: _Vlaggen

source: Reset Flags
nl: Vlaggen herstellen

source: _IO Ports
nl: _I/O-Poorten

source: Reset IO Ports
nl: I/O-poorten herstellen

source: _Memory
nl: _Geheugen

source: Reset Memory
nl: Geheugen herstellen

source: Reset _All
nl: _Alles herstellen

source: Reset All
nl: Alles herstellen

source: A_ssemble
nl: Bou_wen

source: Only assemble program
nl: Applicatie alleen bouwen

source: Execute assembled and loaded program
nl: Gebouwd en geladen applicatie uitvoeren

source: Show _listing
nl: _vermelding Weergeven

source: Show the source code along with opcodes and operands in hex numbers
nl: Geef de broncode samen met de opcodes en operanden weer in hex nummers

source: Step _in
nl: Stap _in

source: Step in the code
nl: Stap in de code

source: Step o_ver
nl: Stap o_ver

source: Step over the code without calling functions
nl: Stap over de code zonder functies te roepen

source: Step _out
nl: Stap _uit

source: Step out of the current function
nl: Stap uit de huidige functie

source: Toggle _breakpoint
nl: Schakel _breekpunt

source: Toggles breakpoint at current line
nl: Schakel breekpunt op huidige lijn

source: _Clear all breakpoints
nl: _Wis alle breekpunten

source: Remove all breakpoints
nl: Verwijder alle breekpunten

source: Stop execution
nl: Stop executie

source: _Contents
nl: _Inhoud

source: Assembler _Tutorial
nl: Assembler _Zelfstudie

source: Show/Hide side pane
nl: Weergeven/Verbergen zijpaneel

source: Flag
nl: Vlag

source: Decimal
nl: Decimaal

source: Enter a decimal number
nl: Voer een decimaal nummer in

source: To Hex
nl: Naar Hex

source: Convert this number to hexadecimal
nl: Zet dit nummer om naar hexadecimaal

source: Enter a hexadecimal number
nl: Voer een hexadecimaal nummer in

source: To Dec
nl: Naar Dec

source: Convert this number to decimal
nl: Zet dit nummer om naar decimaal

source: Decimal - Hex Conversion
nl: Decimaal - Hex Conversie

source: Change the port address to view here
nl: Verander het poort adres om hier weer te geven

source: Enter new port value and click Update
nl: Voer een nieuwe poort waarde in en klik op Update

source: Update Port Value
nl: Update Poort Waarde

source: Update the port value
nl: Update de waarde van de poort

source: I/O Ports
nl: I/O Poorten

source: Change the memory location to view here
nl: Verander de geheugenlocatie om hier weer te geven

source: Edit new value and click Update
nl: Verander de nieuwe waarde en klik op Update

source: Update Memory
nl: Update Geheugen

source: Update the current memory location
nl: Update de huidige geheugenlocatie

source: Memory
nl: Geheugen

source: Load me at
nl: Laad mij op

source: Enter the program address. End with a 'h' if it is a hex address.
nl: Voer het programma adres in. Eindig met een 'h' als het een hex adres is.

source: Data
nl: Gegevens

source: Stack
nl: Stapel

source: KeyPad
nl: ToetsenBlok

source: translator_credits
nl: Leo Ruizendaal

source: Assembler Listing
nl: Assembler Vermelding

source: Save to file
nl: Opslaan naar bestand

source: Assembler Tutorial
nl: Assembler Zelfstudie

source: GNUSim8085 start with dialog
nl: GNUSim8085 start met dialoog

source: 1. How to use this simulator?
nl: 1. Hoe gebruikt men de simulator?

source: _Tutorial
nl: _Zelfstudie

source: A short tutorial on writing assembly code!
nl: Een korte zelfstudie over het schrijven van assembleercode!

source: 2. Open an existing assembly program.
nl: 2. Open een bestaand assembleer programma.

source: _Open program
nl: _Open programma

source: Open an already saved program
nl: Open een al opgeslagen programma

source: What do you want to do now?
nl: Wat wilt u nu doen?

source: Don't forget to read the documentation given in "doc" directory.
nl: Vergeet niet de documentatie te lezen gegeven in de "doc" map.

source: Choose a symbol
nl: Kies een symbool

source: Enter a symbol or choose one from the lists
nl: Voer een symbool in of kies er een uit de lijsten

source: Enter Symbol
nl: Voer een Symbool in

source: Variables List
nl: Variabelen Lijst

source: Functions List
nl: Functie Lijst

source: Macros List
nl: Macro Lijst

source: Choose a register
nl: Kies een register

source: Simulator: Idle
nl: Simulator: Inactief

source: Unwanted %c reached
nl: Ongewenste %c bereikt

source: Invalid Opcode
nl: Ongeldige Opcode

source: Instruction 'RIM' Not implemented
nl: Instructie 'RIM' Niet geïmplementeerd

source: Instruction 'SIM' Not implemented
nl: Instructie 'SIM' Niet geïmplementeerd

source: Assembling Aborted
nl: Assemblage Afgebroken

source: Label should be given to a code line
nl: Label moet worden gegeven aan een regel code

source: Incomplete opcode
nl: Onvoltooide opcode

source: Neither Op not PsOp: [%s]
nl: Niet Op noch PsOp: [%s]

source: Invalid Opcode or Pseudo op
nl: Ongeldige Opcode of Pseudo op

source: Opcode needs an user argument
nl: Opcode heeft een Gebruikersargument nodig

source: Extra characters in line
nl: Extra tekens in regel

source: Expression error in symbol
nl: Expressie fout in symbool

source: Undefined symbol
nl: Ongedefinieerd symbool

source: Redundant label
nl: Overbodig label

source: Invalid Operand in EQU
nl: Ongeldig Operand in EQU

source: Invalid operand
nl: Ongeldig operand

source: Redefinition of symbol
nl: Herdefinitie van symbool

source: Invalid data size
nl: Ongeldige gegevensgrootte

source: DS: Exceeded limit
nl: DS: Limiet overschreden

source: DB: Operand error
nl: DB: Operand fout

source: Invalid operand or symbol. Check whether operands start with a number. e.g a0H should be 0a0H
nl: Ongeldig operand of symbool. Controleer of operanden beginnen met een nummer. bijv. a0H moet zijn 0a0H

source: Program assembled successfully
nl: Programma succesvol geassembleerd

source: Simulator: Program running
nl: Simulator: Programma wordt uitgevoerd

source: Execution branched to invalid memory location <%xH>. Execution will be stopped! Check whether you've included the "hlt" instruction at the end of your program and your source program is not empty. Also check your program logic. If you're very sure, there might be a bug in GNUSim8085.If so you're advised to send a copy of your source program.
nl: Executie vertakt naar een ongeldige geheugenlocatie <%xH>. Executie wordt gestopt! Controleer of je de "hlt" instructie hebt toegevoegd aan het einde van je programma en je broncode niet leeg is. Controleer ook de logica van het programma. Als je het heel zeker weet, is er misschien een fout in GNUSim8085. Als dit het geval is wordt aangeraden om een kopie van de broncode mee te sturen.

source: Assembler: running
nl: Assembler: wordt uitgevoerd

source: Line No
nl: Regel Nummer

source: Assembler Message
nl: Assembler Bericht

source: Address
nl: Adres

source: Variable
nl: Variabele

source: Value
nl: Waarde

source: ; Assembler generated listing; Not editable.
nl: ; Assembler gegenereerde vermelding; Niet bewerkbaar.

source: ; Generated by GNUSim8085: %s
nl: ; Gegenereerd door GNUSim8085: %s

source: ;Assembler Listing (Do Not assemble)
nl: ;Assembler Vermelding (Niet assembleren)

source: Failed to open <%s>
nl: Openen van <%s> is mislukt

source: File already exists; overwrite it?
nl: Bestand bestaat al; vervang het?

source: Failed to save <%s>
nl: Opslaan van <%s> is mislukt

source: Failed to save listing file
nl: Opslaan van vermeldingslijst mislukt

source: Stack Loc
nl: Stapel Locatie

source: Stack size exceeded. Stop the execution
nl: Stapel grootte overschreden. Stop de executie

source: More number of POP are executed than PUSH. Stop the execution and check the logic of your program
nl: Een groter aantal POP dan PUSH uitgevoerd. Stop de executie en controleer de logica van je programma
